
class Hero_Dict:
    def __init__(self):
        pass
        '''第三项是大招，第四项为1 大招是主动释放需要100蓝。为2是被动 不需要蓝'''
        '''hero是全英雄信息,race是种族羁绊,career是职业羁绊,更新时间2019/04/07.'''

    def hero(self):
        hero = {
                '斧王': ['兽人', '战士', '狂战士之吼', 1, 1],
                '魅惑魔女': ['野兽', '德鲁伊', '自然之助', 1, 1],
                '食人魔魔法师': ['食人魔', '法师', '嗜血术', 1, 1],
                '巨牙海民': ['野兽', '战士', '海象神拳', 1, 1],
                '卓尔游侠': ['亡灵', '猎人', '射手天赋', 2, 1],
                '赏金猎人': ['地精', '刺客', '投掷飞镖', 1, 1],
                '发条技师': ['地精', '工匠', '弹幕冲击', 1, 1],
                '暗影萨满': ['巨魔', '萨满祭司', '妖术', 1, 1],
                '蝙蝠骑士': ['巨魔', '骑士', '粘性燃油', 1, 1],
                '修补匠': ['地精', '工匠', '热导飞弹', 1, 1],
                '敌法师': ['精灵', '恶魔猎手', '法力损毁', 2, 1],
                '小小': ['元素', '战士', '投掷', 1, 1],
                '天界战神': ['神', '战士', '护身甲盾', 2, 1],
                '水晶室女': ['人类', '法师', '奥术光环', 2, 2],
                '晶室女': ['人类', '法师', '奥术光环', 2, 2],    # 有可能误识别
                '兽王': ['兽人', '猎人', '野性之斧', 1, 2],
                '剑圣': ['兽人', '战士', '剑刃风暴', 1, 2],
                '伐木机': ['地精', '工匠', '死亡旋风', 1, 2],
                '痛苦女王': ['恶魔', '刺客', '痛苦尖叫', 1, 2],
                '精灵龙': ['精灵', '龙', '法师', '幻象法球', 1, 2],
                '巫医': ['巨魔', '术士', '麻痹药剂', 1, 2],
                '鱼人守卫': ['娜迦', '战士', '侵蚀雾霭', 1, 2],
                '混沌骑士': ['恶魔', '骑士', '混乱之箭', 1, 2],
                '沌骑士': ['恶魔', '骑士', '混乱之箭', 1, 2],
                '昆沌骑士': ['恶魔', '骑士', '混乱之箭', 1, 2],    # 有可能误识别
                '树精卫士': ['精灵', '德鲁伊', '寄生种子', 1, 2],
                '月之骑士': ['精灵', '骑士', '月刃', 2, 2],
                '先知': ['精灵', '德鲁伊', '自然的呼唤', 1, 2],
                '鱼人夜行者': ['娜迦', '刺客', '突袭', 1, 2],
                '变体精灵': ['元素', '刺客', '波浪形态', 1, 2],
                '狼人': ['人类', '野兽', '战士', '变身', 1, 3],
                '剧毒术士': ['野兽', '术士', '瘟疫守卫', 1, 3],
                '周毒术士': ['野兽', '术士', '瘟疫守卫', 1, 3],    # 有可能误识别
                '全能骑士': ['人类', '骑士', '洗礼', 1, 3],
                '闪电幽魂': ['元素', '法师', '等离子场', 1, 3],
                '风行者': ['精灵', '猎人', '强力击', 1, 3],
                '幻影刺客': ['精灵', '刺客', '恩赐解脱', 2, 3],
                '死亡骑士': ['亡灵', '骑士', '无光之盾', 1, 3],
                '沙王': ['野兽', '刺客', '掘地穿刺', 1, 3],
                '狙击手': ['矮人', '猎人', '暗杀', 1, 3],
                '冥界亚龙': ['龙', '刺客', '蝮蛇突袭', 1, 3],
                '影魔': ['恶魔', '术士', '魂之挽歌', 1, 3],
                '秀逗魔导士': ['人类', '法师', '神灭斩', 1, 3],
                '逗魔导士': ['人类', '法师', '神灭斩', 1, 3],     # 有可能误识别
                '灵魂守卫': ['恶魔', '恶魔猎手', '魔化', 1, 3],
                '隐形刺客': ['萨特', '刺客', '烟幕弹', 1, 3],
                '月之女祭司': ['精灵', '猎人', '月神箭', 1, 3],
                '末日使者': ['恶魔', '战士', '末日', 1, 4],
                '海上将军': ['人类', '战士', '幽灵船', 1, 4],
                '巨魔战将': ['巨魔', '战士', '热血战魂', 2, 4],
                '光之守卫': ['人类', '法师', '冲击波', 1, 4],
                '死灵法师': ['亡灵', '术士', '死亡脉冲', 1, 4],
                '圣堂刺客': ['精灵', '刺客', '折光', 1, 4],
                '炼金术士': ['地精', '术士', '化学狂暴', 1, 4],
                '干扰者': ['兽人', '萨满祭司', '静态风暴', 1, 4],
                '蛇发女妖': ['娜迦', '猎人', '石化凝视', 1, 4],
                '龙骑士': ['人类', '龙', '骑士', '古龙形态', 1, 4],
                '利爪德鲁伊': ['野兽', '德鲁伊', '熊灵伙伴', 1, 4],
                '矮人直升机': ['矮人', '工匠', '召唤飞弹', 1, 5],
                '巫妖': ['亡灵', '法师', '连环霜冻', 1, 5],
                '潮汐猎人': ['娜迦', '猎人', '毁灭', 1, 5],
                '谜团': ['元素', '术士', '午夜凋零', 1, 5],
                '地精工程师': ['地精', '工匠', '自爆炸药桶', 1, 5],
                '死亡先知': ['亡灵', '术士', '驱使恶灵', 1, 5],
                '众神之王': ['神', '法师', '雷神之怒', 1, 5],
                }
        return hero

    def race(self):
        race = {
            '人类': {
                '2': '友方人类攻击20%概率使敌人沉默4秒',
                '4': '友方人类攻击25%概率使敌人沉默4秒',
                '6': '友方人类攻击30%概率使敌人沉默4秒'
            },
            '兽人': {
                '2': '友方兽人血量+200',
                '4': '友方兽人血量+500[+200+300]'
            },
            '亡灵': {
                '2': '敌方全体护甲-4',
                '4': '敌方全体护甲-10[-4-6]'
            },
            '野兽': {
                '3': '友方全体攻击+20%(召唤物可继承)',
                '6': '友方全体攻击+50%(召唤物可继承)[+20%+30%]'
            },
            '地精': {
                '3': '随机一友军护甲+15回血+10',
                '6': '友方全体护甲+15回血+10'
            },
            '巨魔': {
                '2': '友方巨魔攻速+35',
                '4': '友方巨魔攻速+30，其中巨魔攻速+65[+35+30]'
            },
            '精灵': {
                '3': '友方精灵闪避+20%',
                '6': '友方精灵闪避+45%[+20%+25%]',
                '9': '友方精灵闪避+75%[+20%+25%+30%]'
            },
            '恶魔': {
                '唯一': '友方场上存在唯一种类恶魔时，该种类恶魔攻击+50%'
            },
            '娜迦': {
                '2': '友方全体魔抗+30',
                '4': '友方全体魔抗+60[+30+30]'
            },
            '元素': {
                '2': '友方元素被近战攻击时30%几率将其石化',
                '4': '友方全体被近战攻击时30%几率将其石化'
            },
            '龙': {
                '3': '友方龙开局满蓝'
            },
            '矮人': {
                '任意': '友方矮人攻击距离+300'
            },
            '食人魔': {
                '任意': '友方食人魔血量+10%'
            },
            '萨特': {
                '任意': '有萨特存在等待区时，隐藏等待区棋子'
            },
            '神': {
                '1': '所有大招冷却时间减半',
                '2': '所有大招冷却时间减半,再减半也就是缩减为1/4'
            }
            }
        return race

    def career(self):
        career = {
            '法师': {
                '3': '友方全体魔抗-30',
                '6': '友方全体魔抗-90[-30-60]'
            },
            '战士': {
                '3': '友方战士护甲+7',
                '6': '友方战士护甲+15[+7+8]',
                '9': '友方战士护甲+25[+7+8+10]'
            },
            '骑士': {
                '2': '友方骑士减伤护盾时间+30%',                      # 得出的概率是3s内开盾的概率
                '4': '友方骑士减伤护盾时间+51%[1-(70% x 70%)]',       # 这里用不开盾的概率计算，不拆开算开几层盾。
                '6': '友方骑士减伤护盾时间+65%[1-(70% x 70% x 70%)]'  # 70%不开第一层*70%不开第二层=49%概率不开盾
            },
            '术士': {
                '3': '友方全体吸血+20%',
                '6': '友方全体吸血+50%[+20%+30%]'
            },
            '猎人': {
                '3': '友方猎人攻击+25%',
                '6': '友方猎人攻击+55%[+25%+30%]'
            },
            '工匠': {
                '2': '友方工匠回血+15',
                '4': '友方工匠回血+40[+15+25]'
            },
            '刺客': {
                '3': '友方刺客普攻10%造成4倍伤害',
                '6': '友方刺客普攻20%造成4被伤害'
            },
            '德鲁伊': {
                '2': '2个相同1星可升至2星',
                '4': '2个相同2星可升至3星'
            },
            '萨满祭司': {
                '2': '开局随机羊一敌人6s'
            },
            '恶魔猎手': {
                '1': '敌方恶魔不加攻击',
                '2': '敌方恶魔不加攻击，友方恶魔攻击+50%'
            },
            }
        return career


if __name__ == '__main__':
    hero = Hero_Dict()
    hero_dict = hero.hero()
    if '斧王' in hero_dict:
        print(hero_dict['斧王'])


